# ë°ì´í„° ì „ì²˜ë¦¬ 2

In [1]:
import pandas as pd

df = pd.read_csv('data/vehicle_prod.csv')
df

  Unnamed: 0   2007   2008   2009   2010   2011
0      China   7.71   7.95  11.96  15.84  16.33
1         EU  19.02  17.71  15.00  16.70  17.48
2         US  10.47   8.45   5.58   7.60   8.40
3      Japan  10.87  10.83   7.55   9.09   7.88
4      Korea   4.04   3.78   3.45   4.20   4.62
5     Mexico   2.01   2.05   1.50   2.25   2.54

### ì»¬ëŸ¼ëª… ë°”ê¾¸ê¸°

In [2]:

df1 = df.rename(columns={'Unnamed: 0' : 'Country'})  
df1

  Country   2007   2008   2009   2010   2011
0   China   7.71   7.95  11.96  15.84  16.33
1      EU  19.02  17.71  15.00  16.70  17.48
2      US  10.47   8.45   5.58   7.60   8.40
3   Japan  10.87  10.83   7.55   9.09   7.88
4   Korea   4.04   3.78   3.45   4.20   4.62
5  Mexico   2.01   2.05   1.50   2.25   2.54

### ê¸°ì¡´ ì—´ì„ ì¸ë±ìŠ¤ë¡œ ì„¤ì •í•˜ëŠ” í•¨ìˆ˜ 

í•¨ìˆ˜ _set_index('ì§€ì •í•œ ì—´', inplace = True(ì›ë³¸) / False(ë¦¬í„´) )

In [3]:

df1.set_index('Country', inplace=True)

In [4]:
df1

          2007   2008   2009   2010   2011
Country
China     7.71   7.95  11.96  15.84  16.33
EU       19.02  17.71  15.00  16.70  17.48
US       10.47   8.45   5.58   7.60   8.40
Japan    10.87  10.83   7.55   9.09   7.88
Korea     4.04   3.78   3.45   4.20   4.62
Mexico    2.01   2.05   1.50   2.25   2.54

### êµ­ê°€ëª…ì„ ì»¬ëŸ¼ìœ¼ë¡œ ì¸ë±ìŠ¤ ì„¤ì •í•˜ê³  ë°”ë¡œ ë°ì´í„° í”„ë ˆì„ìƒì„±

In [10]:
odf = pd.read_csv('data/vehicle_prod.csv', index_col=0)
odf

         2007   2008   2009   2010   2011
China    7.71   7.95  11.96  15.84  16.33
EU      19.02  17.71  15.00  16.70  17.48
US      10.47   8.45   5.58   7.60   8.40
Japan   10.87  10.83   7.55   9.09   7.88
Korea    4.04   3.78   3.45   4.20   4.62
Mexico   2.01   2.05   1.50   2.25   2.54

In [11]:
ofd['2007'] #2007ì˜ ì¸ë±ìŠ¤ê°’ ì¶œë ¥

China      7.71
EU        19.02
US        10.47
Japan     10.87
Korea      4.04
Mexico     2.01
Name: 2007, dtype: float64

In [ ]:
odf[['2007']] #2007ì˜ ì¸ë±ìŠ¤ë¥¼ ê°€ì‹œì„± ìˆê²Œ ì¶œë ¥

         2007
China    7.71
EU      19.02
US      10.47
Japan   10.87
Korea    4.04
Mexico   2.01

In [14]:
odf.columns.tolist()

['2007', '2008', '2009', '2010', '2011']

## âœ… ê°œë… ì •ë¦¬: .columns.tolist()  
DataFrame.columnsëŠ” ì»¬ëŸ¼ëª…(ì—´ ì´ë¦„)ë“¤ì„ ì¸ë±ìŠ¤ ê°ì²´(Index)ë¡œ ë°˜í™˜í•©ë‹ˆë‹¤.

ì—¬ê¸°ì— .tolist()ë¥¼ ë¶™ì´ë©´ ê·¸ê±¸ ë¦¬ìŠ¤íŠ¸ë¡œ ë³€í™˜í•©ë‹ˆë‹¤.

In [ ]:
# ì»¬ë ´ëª…(ì—´ ì´ë¦„)ë“¤ì„ ì¸ë±ìŠ¤ ê°ì²´(Index)ë¡œ ë°˜í™˜

odf.columns

Index(['2007', '2008', '2009', '2010', '2011'], dtype='object')

In [16]:
# .tolist()ë¥¼ ë¶™ì´ë©´ ë¦¬ìŠ¤íŠ¸ë¡œ ë°˜í™˜

odf.columns.tolist()

['2007', '2008', '2009', '2010', '2011']

In [ ]:
odf['2007'] # odfì˜ 2007ë…„ì˜ ì¸ë±ìŠ¤ê°’ í˜¸ì¶œ

China      7.71
EU        19.02
US        10.47
Japan     10.87
Korea      4.04
Mexico     2.01
Name: 2007, dtype: float64

In [ ]:
odf['2007'].tolist() #2007ë…„ì˜ ì¸ë±ìŠ¤ ê°’ì˜ ë¦¬ìŠ¤íŠ¸í™”

[7.71, 19.02, 10.47, 10.87, 4.04, 2.01]

In [ ]:
odf.describe()

            2007       2008       2009       2010       2011
count   6.000000   6.000000   6.000000   6.000000   6.000000
mean    9.020000   8.461667   7.506667   9.280000   9.541667
std     6.019661   5.557519   5.142621   5.935921   6.105887
min     2.010000   2.050000   1.500000   2.250000   2.540000
25%     4.957500   4.822500   3.982500   5.050000   5.435000
50%     9.090000   8.200000   6.565000   8.345000   8.140000
75%    10.770000  10.235000  10.857500  14.152500  14.347500
max    19.020000  17.710000  15.000000  16.700000  17.480000

## âœ… ê°œë… ì •ë¦¬: DataFrame.describe()  
describe()ëŠ” ìˆ˜ì¹˜í˜•(Numeric) ë°ì´í„°ì˜ ëŒ€í‘œ í†µê³„ ì§€í‘œë“¤ì„ í•œëˆˆì— ë³´ì—¬ì¤ë‹ˆë‹¤.

ê¸°ë³¸ì ìœ¼ë¡œ ì•„ë˜ í•­ëª©ë“¤ì´ ì¶œë ¥ë©ë‹ˆë‹¤:

| ì§€í‘œ        | ì„¤ëª…                |
| --------- | ----------------- |
| **count** | ê²°ì¸¡ì¹˜ê°€ ì•„ë‹Œ ë°ì´í„° ê°œìˆ˜    |
| **mean**  | í‰ê· ê°’               |
| **std**   | í‘œì¤€í¸ì°¨ (ë°ì´í„°ì˜ ë¶„ì‚° ì •ë„) |
| **min**   | ìµœì†Œê°’               |
| **25%**   | 1ì‚¬ë¶„ìœ„ìˆ˜ (Q1)        |
| **50%**   | ì¤‘ì•™ê°’ (Q2, median)  |
| **75%**   | 3ì‚¬ë¶„ìœ„ìˆ˜ (Q3)        |
| **max**   | ìµœëŒ€ê°’               |

### âœ… ì‹¤ë¬´ì—ì„œ ì“°ëŠ” ê²½ìš°

ğŸ”¹ 1. ë°ì´í„° ë¶„í¬ í™•ì¸ (ì´ìƒì¹˜, ìŠ¤ì¼€ì¼ í™•ì¸ìš©)

```odf.describe() ```

maxì™€ min ì°¨ì´ê°€ ë„ˆë¬´ í¬ë©´ ì´ìƒì¹˜ ì¡´ì¬ ê°€ëŠ¥

stdê°€ ë„ˆë¬´ í¬ë©´ ê°’ì´ ë„ë›°ê¸° í•¨ â†’ ì •ê·œí™” í•„ìš”ì„± íŒë‹¨

*ì •ê·œí™”ë€ ?*
* ë°ì´í„°ì˜ ê°’ì˜ ë²”ìœ„ë¥¼ ì¼ì •í•˜ê²Œ ì¡°ì •í•˜ëŠ” ì‘ì—…ì„ ëœ»í•©ë‹ˆë‹¤.

*ì •ê·œí™”ê°€ í•„ìš”í•œ ì´ìœ *

| ìƒí™©         | ì´ìœ                                                      |
| ---------- | ------------------------------------------------------ |
| ë¨¸ì‹ ëŸ¬ë‹ í•™ìŠµ ì „ì— | ìŠ¤ì¼€ì¼ì´ ë‹¤ë¥´ë©´ **í•™ìŠµ ì„±ëŠ¥**ì´ ë–¨ì–´ì§ (ì˜ˆ: KNN, SVM, íšŒê·€ëª¨ë¸ ë“± ê±°ë¦¬ ê¸°ë°˜ ëª¨ë¸) |
| ë°ì´í„° ì‹œê°í™”    | í° ê°’ ë•Œë¬¸ì— ì‘ì€ ê°’ì´ ì•ˆ ë³´ì´ëŠ” ê²½ìš°, ì‹œê°í™” ì™œê³¡ ë°©ì§€                      |
| ì´ìƒì¹˜ íƒì§€     | ê°’ ë²”ìœ„ê°€ ë¹„ìŠ·í•´ì•¼ ì´ìƒì¹˜ê°€ ëšœë ·í•˜ê²Œ ë“œëŸ¬ë‚¨                               |
| PCA ë“± ì°¨ì›ì¶•ì†Œ | ëª¨ë“  featureê°€ ê°™ì€ ê¸°ì¤€ì´ì–´ì•¼ ì˜¬ë°”ë¥´ê²Œ ì‘ë™í•¨                          |

ğŸ”¹ 2. ê²°ì¸¡ì¹˜ í™•ì¸

```odf.describe().loc['count'] == len(odf)```

Falseê°€ ë‚˜ì˜¤ë©´ ê²°ì¸¡ì¹˜ê°€ ì¡´ì¬í•˜ëŠ” ì—´ì´ë¼ëŠ” ëœ»

In [24]:
odf.describe().iloc[:] == len(odf) # ì „ì²´ ê²°ì¸¡ì¹˜ í™•ì¸

        2007   2008   2009   2010   2011
count   True   True   True   True   True
mean   False  False  False  False  False
std    False  False  False  False  False
min    False  False  False  False  False
25%    False  False  False  False  False
50%    False  False  False  False  False
75%    False  False  False  False  False
max    False  False  False  False  False

ğŸ”¹ 3. ë²”ì£¼í˜• í¬í•¨ ìš”ì•½ ë³´ê³  ì‹¶ì„ ë•Œ

```odf.describe(include='all')```

ìˆ˜ì¹˜í˜•ë¿ ì•„ë‹ˆë¼ ë¬¸ìí˜•, ë‚ ì§œí˜• ë“± ëª¨ë“  ì—´ì˜ ìš”ì•½ ì •ë³´ë„ í™•ì¸ ê°€ëŠ¥

ë¬¸ìí˜•ì—ëŠ” unique, top, freqê°€ ë‚˜ì˜´

ğŸ”¹ 4. íŠ¹ì • ì—´ë§Œ describe

```odf[['sales', 'profit']].describe()```

ê´€ì‹¬ ìˆëŠ” ì—´ë§Œ ë½‘ì•„ì„œ í™•ì¸ ê°€ëŠ¥

# âœ… ìƒê´€ë¶„ì„
ë³€ìˆ˜ë“¤ ê°„ì˜ ë³€í™”ì˜ ìœ ì‚¬ë„,
- ìŒì˜ìƒê´€: ì„œë¡œ ë°˜ëŒ€ ë°©í–¥ìœ¼ë¡œ ë³€í™”, ì¦ê°€>ê°ì†Œ, ê°ì†Œ>ì¦ê°€
- ì–‘ì˜ìƒê´€: ì„œë¡œ ê°™ì€ ë°©í–¥ìœ¼ë¡œ ë³€í™”, ì¦ê°€>ì¦ê°€, ê°ì†Œ>ê°ì†Œ

## âœ… ê°œë…: corr()ì´ë€?
.corr()ëŠ” ë°ì´í„°í”„ë ˆì„ ë‚´ ìˆ˜ì¹˜í˜• ì—´ë“¤ ê°„ì˜ ì„ í˜• ìƒê´€ê´€ê³„ë¥¼ ê³„ì‚°í•©ë‹ˆë‹¤.
ê¸°ë³¸ì ìœ¼ë¡œ **í”¼ì–´ìŠ¨ ìƒê´€ê³„ìˆ˜(Pearson correlation coefficient)**ë¥¼ ì‚¬ìš©í•©ë‹ˆë‹¤.

ğŸ“Œ ìƒê´€ê³„ìˆ˜(Pearson correlation coefficient)
ê°’ ë²”ìœ„: â€“1 ~ +1

ì˜ë¯¸:
| ìƒê´€ê³„ìˆ˜ | í•´ì„                         |
| ---- | -------------------------- |
| +1   | ì™„ì „í•œ ì–‘ì˜ ìƒê´€ê´€ê³„ (ê°™ì´ ì¦ê°€)        |
| 0    | ìƒê´€ê´€ê³„ ì—†ìŒ                    |
| â€“1   | ì™„ì „í•œ ìŒì˜ ìƒê´€ê´€ê³„ (í•œìª½ ì¦ê°€, í•œìª½ ê°ì†Œ) |

In [25]:
odf.corr()

          2007      2008      2009      2010      2011
2007  1.000000  0.991073  0.831447  0.769040  0.758271
2008  0.991073  1.000000  0.872296  0.810529  0.789512
2009  0.831447  0.872296  1.000000  0.988513  0.980025
2010  0.769040  0.810529  0.988513  1.000000  0.992667
2011  0.758271  0.789512  0.980025  0.992667  1.000000

In [30]:
odf.sum(axis=1, numeric_only=True)

China     59.79
EU        85.91
US        40.50
Japan     46.22
Korea     20.09
Mexico    10.35
dtype: float64

In [32]:
# 2007~2011 ë…„ê¹Œì§€ì˜ ìƒì‚°ëŸ‰ì„ í•©í•œ total_production ì»¬ëŸ¼ì„ ìƒì„±í•´ë³´ì
odf['total_production'] = df.sum(axis=1, numeric_only=True)
odf

         2007   2008   2009   2010   2011  total_production
China    7.71   7.95  11.96  15.84  16.33               NaN
EU      19.02  17.71  15.00  16.70  17.48               NaN
US      10.47   8.45   5.58   7.60   8.40               NaN
Japan   10.87  10.83   7.55   9.09   7.88               NaN
Korea    4.04   3.78   3.45   4.20   4.62               NaN
Mexico   2.01   2.05   1.50   2.25   2.54               NaN